# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+title: All Together Now: A Synchronous Platform for Distributed Spatial Audio
#+author: Thomas Rushton

#+startup: overview
#+export_file_name: out/sive2025
#+options: author:nil toc:nil num:3
#+latex_class: sive2025
#+bibliography: sive2025.bib
#+cite_export: biblatex
#+latex_header_extra: \RequirePackage[]{./out/sive2025}
#+refproc: :abbreviate nil

** What's the cost per channel again?

Excluding the cost of a computer, speakers and cables:

#+begin_src emacs-lisp
(let* ((teensy-cost 31.5)
       (audio-shield-cost 14.4)
       (ethernet-kit-cost 3.9)
       (switch-cost 200)
       (computer-cost 1500)
       (num-ports 24)
       (output-channels-per-port 2)
       (num-channels (* output-channels-per-port num-ports))
       (basic-cost (+ switch-cost
                      (* num-ports
                         (+ teensy-cost audio-shield-cost ethernet-kit-cost))))
       (cost-per-channel (/ basic-cost num-channels))
       (cost-per-channel-with-pc (/ (+ basic-cost computer-cost) num-channels)))
  (format
   (string-join '("€ %.2f %d-channel system"
                  "€ %.2f (incl. computer)"
                  "€ %.2f per channel"
                  "€ %.2f per channel (incl. computer)") "\n")
   basic-cost num-channels
   (+ basic-cost computer-cost)
   cost-per-channel
   cost-per-channel-with-pc))
#+end_src

#+RESULTS:
: € 1395.20 48-channel system
: € 2895.20 (incl. computer)
: € 29.07 per channel
: € 60.32 per channel (incl. computer)

** And how far does sound travel in, e.g., 1 \micro{}s?

#+begin_src emacs-lisp
(let* ((c 343.)
       (time-s 1e-6)
       (cmpm (/ 1. 1e-2))
       (mmpm (/ 1. 1e-3))
       (dist-m (* c time-s)))
  (format "%.2f m\n%.2f cm\n%.2f mm" dist-m (* dist-m cmpm) (* dist-m mmpm)))
#+end_src

#+RESULTS:
: 0.00 m
: 0.03 cm
: 0.34 mm

* Background
:PROPERTIES:
:CUSTOM_ID: sec:bg
:END:

The importance of sound in the immersive experience is
well-established\nbsp[cite:@buckEffect2022]; if, however, the auditory
aspect of virtual and extended reality remains comparatively neglected
when considered alongside other sensory
channels\nbsp[cite:@serafinReflections2020], this may be ascribed, in part
at least, to the complexity of, and expense associated with, [creating
immersive audio installations]. Large-scale, multichannel spatial
audio systems are typically very expensive affairs, reliant on
proprietary systems, costly hardware, specialist software and
[etc.]\nbsp[cite:@rushtonNetworked2024]. Particularly in the case of
virtual acoustics [not really...], in which one may wish for numerous
participants to experience the same auditory environment, unencumbered
by headsets and so on, an immersive acoustic environment is desirable,
and yet may lie out of reach, for practial purposes. Thus the
exclusivity of multichannel audio systems has a chilling effect on
research.



- Why spatial audio?
  - immersive auditory experiences, VR, virtual acoustics
- What are typical systems like?
  - MADI/AoE
  - point-to-point vs... multicast
- Why would an alternative be desirable?
- What attempts have been made?
  - Belloch et al., Devonport & Foss
  - Frugal WFS, Ottosonics, DIY/maker community
- Importance of synchronisation
- How to synchronise?
- The ideal platform: requirements
  - The switch too

#+begin_src emacs-lisp :exports none
(let* ((usd-eur .96)
       (cm5 51.72)
       (cm5io 18.07)
       (i2s-hat 18.91)
       (t41 31.5)
       (audio-shield 14.4)
       (ethernet-addon 3.9)
       (rpi (+ cm5 cm5io i2s-hat))
       (teensy (* usd-eur (+ t41 audio-shield ethernet-addon))))
  (format "RPi cost: € %.2f\nTeensy cost: € %.2f" rpi teensy))
#+end_src

#+RESULTS:
: RPi cost: € 88.70
: Teensy cost: € 47.81

#+name: tab:platforms
#+caption: Selected embedded computing platforms listed with their
#+caption: corresponding system on chip (SoC) and availaibility of
#+caption: selected functionality.
#+attr_latex: :float multicolumn :align lllllr
| Platform         | SoC              | Memory      | Ethernet | PTP | Cost |
|------------------+------------------+-------------+----------+-----+------|
| Raspberry Pi CM5 | Broadcom BCM2712 | 2 GB SDRAM  | Yes      | Yes | € 89 |
| Teensy 4.1       | NXP iMXRT1062    | 1024 KB RAM | Yes      | Yes | € 48 |
| Daisy Seed       | STM32H750IB      | 65 MB SDRAM | No       | Yes | € 25 |


What does it take synchronise playback on physically separate audio
devices?

[cite:@friedtSynchronisation2023]

At the risk of labouring the point, we remind the reader that whether
one has a budget of millions, or are compelled to pursue a more frugal
approach, decision-making around the not-inconsiderable endeavour of
establishing a large-scale audio system for research, entertainment, or
other purposes revolves around questions such as
- How well does this technology work?
- How much of a /sunk-cost/ does an installation based on this
  technology represent?
- Will this system still work in several years' time?

* Implementation
:PROPERTIES:
:CUSTOM_ID: sec:impl
:END:

Teensy's 30-bit clock divider registers.

Taking the nsps ethernet clock adjustment, assuming safely that
ethernet and audio clocks are derived from the same master clock, and
adjust the audio clock accordingly to produce the corresponding
sampling frequency.

It's a simple case of applying the adjustment, \(a\), in nanoseconds, 

#+NAME: eq:fine-num-1
\begin{equation}
f_{s} = \hat{f}_{s}\left(1 + \frac{a}{\num{1e9}}\right)\;.
\end{equation}

For example, should a subscriber, running at a nominal \qty{48}{\kHz},
drift fast over a given second by \qty{1750}{\nano\second}, the new
sampling frequency to be applied should be

#+begin_src emacs-lisp :exports none
(let* ((fs 48e3)
       (drift -1750)
       (nsps 1e9)
       (ratio (+ 1 (/ drift nsps)))
       (newfs (* fs ratio))
       (frac-diff (/ 1. (- 48e3 newfs))))
  (format "Ratio: %.9f, new fs: %.9f Hz, fractional diff: 1/%.1f Hz" ratio newfs frac-diff))
#+end_src

#+RESULTS:
: Ratio: 0.999998250, new fs: 47999.916000000 Hz, fractional diff: 1/11.9 Hz

#+NAME: eq:fs-example
\begin{align*}
f_{s} &= \num{48000}\left(1 + \frac{-1750}{\num{1e9}}\right) \\
  &= \num{48000} \times \num{0.999998925} \\
  &= \qty{47999.916}{\Hz}\;,
\end{align*}
or about \(\frac{1}{12}\)\unit{\Hz} slower. 

